; domain
(define (domain Food_Delivery_Domain)
  (:requirements :strips :typing :adl :fluents :action-costs)
  
  (:types point restaurant customer transport)
  
  (:predicates (path ?point ?point)
               (Restaurant-at ?restaurant ?point)
               (Customer-at ?customer ?point)
               (Transport-at ?transport ?point)
               (PreparingFoodFor ?restaurant ?customer)
               (CarryingFoodFor ?transport ?customer)
               (NotCarryingFood ?transport)
               (ReceivedFood ?customer))
			   
	(:functions (total-cost)
                (distance ?point ?point)
                (per_km_cost ?transport - transport)
	)

  (:action Travel
    :parameters (?transport - transport ?start - point ?destination - point)
    :precondition (and (Transport-at ?transport ?start) 
                      (path ?start ?destination))
    :effect (and (not (Transport-at ?transport ?start)) 
                      (Transport-at ?transport ?destination) 
                      (increase (total-cost) (* (distance ?start ?destination)(per_km_cost ?transport)))) 
   )

  (:action PickUpFood
    :parameters (?transport - transport ?restaurant - restaurant ?customer - customer ?point - point)
    :precondition (and (Transport-at ?transport ?point) 
                        (Restaurant-at ?restaurant ?point) 
                        (NotCarryingFood ?transport) 
                        (PreparingFoodFor ?restaurant ?customer))
    :effect (and (not(NotCarryingFood ?transport)) 
                      (CarryingFoodFor ?transport ?customer) 
                      (not (PreparingFoodFor ?restaurant ?customer)))
   )  
   
  (:action DeliverFood
    :parameters (?transport - transport ?customer - customer ?point - point)
    :precondition (and (Transport-at ?transport ?point) 
                        (Customer-at ?customer ?point) 
                        (CarryingFoodFor ?transport ?customer)
                        (not(NotCarryingFood ?transport)))
    :effect (and (NotCarryingFood ?transport) 
                  (not (CarryingFoodFor ?transport ?customer)) 
                  (ReceivedFood ?customer))
   )
 )

; problem
(define (problem Food_Delivery_Problem)
  (:domain Food_Delivery_Domain)
  (:objects Customer1 Customer2 Customer3 Customer4 Customer5 - customer
            Restaurant1 Restaurant2 Restaurant3 - restaurant
            Bike1 BiCycle1 - transport
            p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13  - point)
  (:init 
  (= (total-cost) 0)
  
  (Customer-at Customer1 p1)
  (Customer-at Customer2 p5)
  (Customer-at Customer3 p7)
  (Customer-at Customer4 p10)
  (Customer-at Customer5 p12)
  
  
  (Restaurant-at Restaurant1 p3)
  (Restaurant-at Restaurant2 p6)
  (Restaurant-at Restaurant3 p13)
  
  (path p1 p2)
  (path p2 p1)
  (path p2 p3)
  (path p3 p2)
  (path p3 p4)
  (path p4 p3)
  (path p4 p5)
  (path p5 p4)
  (path p5 p6)
  (path p6 p5)
  (path p6 p7)
  (path p7 p6)
  (path p7 p8)
  (path p8 p7)
  (path p7 p13)
  (path p13 p7)
  (path p8 p13)
  (path p13 p8)
  (path p9 p13)
  (path p13 p9)
  (path p9 p3)
  (path p3 p9)
  (path p9 p10)
  (path p10 p9)
  (path p10 p11)
  (path p11 p10)
  (path p11 p1)
  (path p11 p1)
  (path p11 p12)
  (path p12 p11)
  (path p12 p13)
  (path p13 p12)
  
  (= (distance p1 p2) 12)
  (= (distance p2 p1) 12)
  (= (distance p2 p3) 5)
  (= (distance p3 p2) 5)
  (= (distance p3 p4) 7)
  (= (distance p4 p3) 7)
  (= (distance p4 p5) 11)
  (= (distance p5 p4) 11)
  (= (distance p5 p6) 3)
  (= (distance p6 p5) 3)
  (= (distance p6 p7) 8)
  (= (distance p7 p6) 8)
  (= (distance p7 p8) 2)
  (= (distance p8 p7) 2)
  (= (distance p7 p13) 10)
  (= (distance p13 p7) 10)
  (= (distance p8 p13) 7)
  (= (distance p13 p8) 7)
  (= (distance p9 p13) 4)
  (= (distance p13 p9) 4)
  (= (distance p9 p3) 6)
  (= (distance p3 p9) 6)
  (= (distance p9 p10) 1)
  (= (distance p10 p9) 1)
  (= (distance p10 p11) 8)
  (= (distance p11 p10) 8)
  (= (distance p11 p1) 7)
  (= (distance p1 p11) 7)
  (= (distance p11 p12) 4)
  (= (distance p12 p11) 4)
  (= (distance p12 p13) 9)
  (= (distance p13 p12) 9)
  
  (= (per_km_cost Bike1) 4)
  (= (per_km_cost BiCycle1) 2.5)
  
  
  (Transport-at Bike1 p2)
  (Transport-at BiCycle1 p8)
  
  (PreparingFoodFor Restaurant1 Customer1)
  (PreparingFoodFor Restaurant2 Customer2)
  (PreparingFoodFor Restaurant3 Customer3)
  (PreparingFoodFor Restaurant2 Customer4)
  (PreparingFoodFor Restaurant3 Customer5)
  
  
  (NotCarryingFood Bike1)
  (NotCarryingFood BiCycle1)
  
  )
  (:goal (and (ReceivedFood Customer1) (ReceivedFood Customer2) (ReceivedFood Customer3)(ReceivedFood Customer4) (ReceivedFood Customer5)))
  
  (:metric minimize (total-cost))
  )

; plan
1. (travel bicycle1 p8 p7)
   deleted: (transport-at bicycle1 p8)
   added: (transport-at bicycle1 p7)
   goals met: 0 of 5
2. (travel bicycle1 p7 p6)
   deleted: (transport-at bicycle1 p7)
   added: (transport-at bicycle1 p6)
   goals met: 0 of 5
3. (pickupfood bicycle1 restaurant2 customer2 p6)
   deleted: (notcarryingfood bicycle1) (preparingfoodfor restaurant2 customer2)
   added: (carryingfoodfor bicycle1 customer2)
   goals met: 0 of 5
4. (travel bicycle1 p6 p5)
   deleted: (transport-at bicycle1 p6)
   added: (transport-at bicycle1 p5)
   goals met: 0 of 5
5. (deliverfood bicycle1 customer2 p5)
   deleted: (carryingfoodfor bicycle1 customer2)
   added: (notcarryingfood bicycle1) (receivedfood customer2)
   goals met: 1 of 5
6. (travel bike1 p2 p3)
   deleted: (transport-at bike1 p2)
   added: (transport-at bike1 p3)
   goals met: 1 of 5
7. (travel bike1 p3 p9)
   deleted: (transport-at bike1 p3)
   added: (transport-at bike1 p9)
   goals met: 1 of 5
8. (travel bike1 p9 p13)
   deleted: (transport-at bike1 p9)
   added: (transport-at bike1 p13)
   goals met: 1 of 5
9. (pickupfood bike1 restaurant3 customer5 p13)
   deleted: (notcarryingfood bike1) (preparingfoodfor restaurant3 customer5)
   added: (carryingfoodfor bike1 customer5)
   goals met: 1 of 5
10. (travel bike1 p13 p12)
   deleted: (transport-at bike1 p13)
   added: (transport-at bike1 p12)
   goals met: 1 of 5
11. (deliverfood bike1 customer5 p12)
   deleted: (carryingfoodfor bike1 customer5)
   added: (notcarryingfood bike1) (receivedfood customer5)
   goals met: 2 of 5
12. (travel bike1 p12 p13)
   deleted: (transport-at bike1 p12)
   added: (transport-at bike1 p13)
   goals met: 2 of 5
13. (pickupfood bike1 restaurant3 customer3 p13)
   deleted: (notcarryingfood bike1) (preparingfoodfor restaurant3 customer3)
   added: (carryingfoodfor bike1 customer3)
   goals met: 2 of 5
14. (travel bike1 p13 p7)
   deleted: (transport-at bike1 p13)
   added: (transport-at bike1 p7)
   goals met: 2 of 5
15. (deliverfood bike1 customer3 p7)
   deleted: (carryingfoodfor bike1 customer3)
   added: (notcarryingfood bike1) (receivedfood customer3)
   goals met: 3 of 5
16. (travel bicycle1 p5 p4)
   deleted: (transport-at bicycle1 p5)
   added: (transport-at bicycle1 p4)
   goals met: 3 of 5
17. (travel bicycle1 p4 p3)
   deleted: (transport-at bicycle1 p4)
   added: (transport-at bicycle1 p3)
   goals met: 3 of 5
18. (pickupfood bicycle1 restaurant1 customer1 p3)
   deleted: (notcarryingfood bicycle1) (preparingfoodfor restaurant1 customer1)
   added: (carryingfoodfor bicycle1 customer1)
   goals met: 3 of 5
19. (travel bicycle1 p3 p2)
   deleted: (transport-at bicycle1 p3)
   added: (transport-at bicycle1 p2)
   goals met: 3 of 5
20. (travel bicycle1 p2 p1)
   deleted: (transport-at bicycle1 p2)
   added: (transport-at bicycle1 p1)
   goals met: 3 of 5
21. (deliverfood bicycle1 customer1 p1)
   deleted: (carryingfoodfor bicycle1 customer1)
   added: (notcarryingfood bicycle1) (receivedfood customer1)
   goals met: 4 of 5
22. (travel bike1 p7 p6)
   deleted: (transport-at bike1 p7)
   added: (transport-at bike1 p6)
   goals met: 4 of 5
23. (pickupfood bike1 restaurant2 customer4 p6)
   deleted: (notcarryingfood bike1) (preparingfoodfor restaurant2 customer4)
   added: (carryingfoodfor bike1 customer4)
   goals met: 4 of 5
24. (travel bike1 p6 p7)
   deleted: (transport-at bike1 p6)
   added: (transport-at bike1 p7)
   goals met: 4 of 5
25. (travel bike1 p7 p13)
   deleted: (transport-at bike1 p7)
   added: (transport-at bike1 p13)
   goals met: 4 of 5
26. (travel bike1 p13 p9)
   deleted: (transport-at bike1 p13)
   added: (transport-at bike1 p9)
   goals met: 4 of 5
27. (travel bike1 p9 p10)
   deleted: (transport-at bike1 p9)
   added: (transport-at bike1 p10)
   goals met: 4 of 5
28. (deliverfood bike1 customer4 p10)
   deleted: (carryingfoodfor bike1 customer4)
   added: (notcarryingfood bike1) (receivedfood customer4)
   goals met: 5 of 5
